# Operations on DataFrames

In [1]:
import numpy as np
import pandas as pd
np.random.seed(101)

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## Finding Unique values

**There are 3 important methods to find unique values in DataFrame**
- unique()  - finds unique value in the data frame
- nunique() - no of unique value in the column
- value_counts() - counts the values and their occurances
> all of these methods works on columns only

In [4]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [5]:
df['col2'].nunique()

3

In [6]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

## Selecting Data

Using multiple conditions, selecting the data

In [7]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

### Applying Functions

In [8]:
def times2(x):
    return x*2

In [9]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [10]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [11]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [12]:
df['col2'].sum()

2109

### Geting colnames and rownames

using `df.columns` to get the column names

In [13]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

Using `index` to get the rownames

In [14]:
df.index

RangeIndex(start=0, stop=4, step=1)

### Sorting and ordering a DataFrame

`df.sort_values(column_name)` to sort DataFrame

In [15]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [16]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

Sorting in Descending order

In [17]:
df.sort_values('col3', ascending=False)

   col1  col2 col3
3     4   444  xyz
2     3   666  ghi
1     2   555  def
0     1   444  abc

### fidning null values

In [18]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

### Droping a column

`del df[colname]` is used to delete a column, directly dataframe is affected

In [19]:
del df['col1']

In [20]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

### Pivot Tables

In [21]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [22]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [23]:
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

---

# CSV files

In [24]:
df1 = pd.read_csv('Dataset/example')
df1

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

Writing df1 to csv files

In [25]:
df1.to_csv('Dataset/example.csv',index=False)

# Excel files

### Reading Excel files

In [26]:
df2 = pd.read_excel('Dataset/Excel_Sample.xlsx', sheet_name='Sheet1')
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### Writing to Excel

In [27]:
df2.to_excel('Dataset/Excel1.xlsx', sheet_name='Data')

This commands has written the files at specific location

---

## HTML

### Reading from the web

In [28]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [29]:
df[0].shape

(555, 7)

In [30]:
test = df[0].copy()

In [31]:
test.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"

In [32]:
test.tail()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
550,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
551,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
552,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
553,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
554,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [33]:
test.describe()

               CERT
count    555.000000
mean   31702.318919
std    16401.784351
min       91.000000
25%    20315.000000
50%    32185.000000
75%    35364.000000
max    58701.000000

---

# Sql

In [2]:
from sqlalchemy import create_engine

This is going to create the table in the memory

In [3]:
engine = create_engine('sqlite:///:memory:')

In [4]:
type(engine)

sqlalchemy.engine.base.Engine

In [5]:
df = pd.read_csv('Dataset/example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

Writing to a sql table

In [6]:
df.to_sql('data', engine)

In [7]:
df3 = pd.read_sql('data', con=engine)

In [8]:
df3

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15